opensoap/samples/SimpleCalc/SimpleCalcSampleMessages/subtract_request.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <m:Subtract xmlns:m="http://services.opensoap.jp/samples/SimpleCalc/">
            <A>10.000000</A>
            <B>20.000000</B>
        </m:Subtract>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>